package day0919;
//
// 공통 규칙
// 1. 자바에서는 대소문자가 엄격하게 구분된다.
// 2. 자바에서는 이름에 _ 를 제외한 특수문자는 사용할수 없다.
// 3. 자바에서는 이름을 숫자로 시작할 수 없다.
// 4. 자바에서는 50여가지의 내부적으로 정의된 주요단어들이 있다.
// 해당 단어로는 이름을 지을 수 없다.

// 낙타등 표기법(Camel Back Notation)
// 낙타등 표기법이란, 어떠한 것의 이름이 여러 단어로 되어 있을 경우,
// 단어간의 구분을 쉽게 하기 위해서 두번째 단어부터는 각 단어의 첫글자를
// 대문자로 적어주는 방법이다.

// 뱀 표기법(Snake Notation)
// 뱀 표기법이란, 이름의 모든 철자를 대문자로 적는 경우
// 단어간의 구분을 쉽게 하기 위해서 단어 사이에 _를 넣어주는 방법이다.

// 각 개념에 따른 명명 규칙
// 1. 클래스: 대문자로 시작하고 낙타등 표기법을 사용하는 명사
// 2. 패키지: 소문자로 시작하고 해당 패키지 안에 있는 클래스들의 성격을 나타내는 한개의 명사
// 3. 메소드: 소문자로 시작하고 낙타등 표기법을 사용하는 동사
// 4. 변수: 소문자로 시작하고 낙타등 표기법을 사용하는 명사
// 5. 상수: 뱀 표기법을 사용하는 명사

public class Ex02Naming {
}
